src/Enums/СтатусОтпавкиНаСайт/СтатусОтпавкиНаСайт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусОтпавкиНаСайт</name>
  <enumValues>
    <name>Сформирован</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Исправлено</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/СтоСПФоновые/Module.bsl
#Область Раз
Процедура Запустить_Выгрузку_100СП() экспорт
	
	СтоСПОбмен_Посылки.ВыгрузитьНеВыгруженныеПосылки();	
	
	
	пакет=Документы.Выгрузка_100СП.СоздатьДокумент();
	пакет.Дата=ТекущаяДата();
	ОбъектовКВыгрузке=пакет.ЗаполнитьНеОтправленными();
	
	Если ОбъектовКВыгрузке=0 Тогда Возврат КонецЕсли;
	пакет.Записать(РежимЗаписиДокумента.Запись);
	//пакет.СкомпоноватьДляВыгрузки();
	пакет.ВыгрузитьНаСайт();
	Если пакет.Статус=Перечисления.СтатусОтпавкиНаСайт.Отправлен Тогда
		Попытка
		    Пакет.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ЗаписьЖурналаРегистрации("Обмен100СП.ЗаписьПакета",УровеньЖурналаРегистрации.Ошибка,пакет,,
										ОписаниеОшибки());
		КонецПопытки;
	Иначе	
		Попытка
			пакет.Статус=Перечисления.СтатусОтпавкиНаСайт.Сформирован;
		    Пакет.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ЗаписьЖурналаРегистрации("Обмен100СП.ЗаписьПакета",УровеньЖурналаРегистрации.Ошибка,пакет,,
										ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
